-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 22 2024 г., 01:06
-- Версия сервера: 10.3.13-MariaDB
-- Версия PHP: 7.1.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `schedules`
--

-- --------------------------------------------------------

--
-- Структура таблицы `schedule_23isps1`
--

CREATE TABLE `schedule_23isps1` (
  `id` int(11) NOT NULL,
  `number_of_lesson` int(1) NOT NULL,
  `day_of_week` varchar(3) NOT NULL,
  `lesson_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `schedule_23isps1`
--

INSERT INTO `schedule_23isps1` (`id`, `number_of_lesson`, `day_of_week`, `lesson_name`) VALUES
(1, 1, 'mon', 'Разговоры о важном'),
(2, 1, 'tue', 'Экология отрасли'),
(3, 1, 'wed', '-'),
(4, 1, 'thu', 'Проектирование и дизайн информационных систем'),
(5, 1, 'fri', 'Численные методы'),
(6, 2, 'mon', 'Правовое обеспечение профессиональной деятельности'),
(7, 2, 'tue', 'Экология отрасли'),
(8, 2, 'wed', '-'),
(9, 2, 'thu', 'Проектирование и дизайн информационных систем'),
(10, 2, 'fri', 'Численные методы'),
(11, 3, 'mon', 'Правовое обеспечение профессиональной деятельности'),
(12, 3, 'tue', 'Иностранный язык в профессиональной деятельности'),
(13, 3, 'wed', 'Проектирование и дизайн информационных систем'),
(14, 3, 'thu', 'Численные методы'),
(15, 3, 'fri', 'Проектирование и разработка веб-приложений'),
(16, 4, 'mon', 'Иностранный язык в профессиональной деятельности'),
(17, 4, 'tue', 'Иностранный язык в профессиональной деятельности'),
(18, 4, 'wed', 'Проектирование и дизайн информационных систем'),
(19, 4, 'thu', 'Численные методы'),
(20, 4, 'fri', 'Проектирование и разработка веб-приложений'),
(21, 5, 'mon', 'Иностранный язык в профессиональной деятельности'),
(22, 5, 'tue', 'Разработка кода информационных систем'),
(23, 5, 'wed', 'Правовое обеспечение профессиональной деятельности'),
(24, 5, 'thu', 'Основы информационной безопасности'),
(25, 5, 'fri', 'Компьютерные сети'),
(26, 6, 'mon', 'Компьютерные сети'),
(27, 6, 'tue', 'Разработка кода информационных систем'),
(28, 6, 'wed', 'Правовое обеспечение профессиональной деятельности'),
(29, 6, 'thu', 'Основы информационной безопасности'),
(30, 6, 'fri', 'Компьютерные сети'),
(31, 7, 'mon', 'Физическая культура'),
(32, 7, 'tue', '-'),
(33, 7, 'wed', 'Безопасность жизнедеятельности'),
(34, 7, 'thu', 'Экология отрасли'),
(35, 7, 'fri', 'Основы проектирования баз данных'),
(36, 8, 'mon', 'Основы информационной безопасности'),
(37, 8, 'tue', '-'),
(38, 8, 'wed', 'Тестирование информационных систем'),
(39, 8, 'thu', 'Экология отрасли'),
(40, 8, 'fri', 'Основы проектирования баз данных');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `schedule_23isps1`
--
ALTER TABLE `schedule_23isps1`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `schedule_23isps1`
--
ALTER TABLE `schedule_23isps1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
